## Goal:  Explore a dataframe in Pandas

### Step 1:  Import Pandas library

In [4]:
import pandas as pd               # import Pandas and display version
pd.__version__

'1.1.3'

### Step 2:  Find a data set

* I chose to explore cities.csv from the website https://people.sc.fsu.edu/~jburkardt/data/csv/csv.html

### Step 3:  Read in the file

In [18]:
df=pd.read_csv("cities.csv")      # read in the file

### Step 4:  Explore the data

In [19]:
df.head(8)                        # display the first 8 rows

,LatD,"""LatM""","""LatS""","""NS""","""LonD""","""LonM""","""LonS""","""EW""","""City""","""State"""
0,41,5,59,"""N""",80,39,0,"""W""","""Youngstown""",OH
1,42,52,48,"""N""",97,23,23,"""W""","""Yankton""",SD
2,46,35,59,"""N""",120,30,36,"""W""","""Yakima""",WA
3,42,16,12,"""N""",71,48,0,"""W""","""Worcester""",MA
4,43,37,48,"""N""",89,46,11,"""W""","""Wisconsin Dells""",WI
5,36,5,59,"""N""",80,15,0,"""W""","""Winston-Salem""",NC
6,49,52,48,"""N""",97,9,0,"""W""","""Winnipeg""",MB
7,39,11,23,"""N""",78,9,36,"""W""","""Winchester""",VA

In [21]:
df.shape                           #.shape gives the number of rows by the number of columns

(128, 10)

In [28]:
df.tail(3)                         # display the last 3 rows

,LatD,"""LatM""","""LatS""","""NS""","""LonD""","""LonM""","""LonS""","""EW""","""City""","""State"""
125,40,10,48,"""N""",122,14,23,"""W""","""Red Bluff""",CA
126,40,19,48,"""N""",75,55,48,"""W""","""Reading""",PA
127,41,9,35,"""N""",81,14,23,"""W""","""Ravenna""",OH

In [31]:
df[:4].transpose()                 # for the first 4 rows, transpose the df

                      0           1          2             3
LatD                 41          42         46            42
 "LatM"               5          52         35            16
 "LatS"              59          48         59            12
 "NS"               "N"         "N"        "N"           "N"
 "LonD"              80          97        120            71
 "LonM"              39          23         30            48
 "LonS"               0          23         36             0
 "EW"               "W"         "W"        "W"           "W"
 "City"    "Youngstown"   "Yankton"   "Yakima"   "Worcester"
 "State"             OH          SD         WA            MA